import {Component, OnInit} from '@angular/core';

@Component({
  selector: 'app-article-list1',
  templateUrl: './article-list1.component.html',
  styleUrls: ['./article-list1.component.css']
})
export class ArticleList1Component implements OnInit {
  articleTemp: any[] = [
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    },
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    },
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    },
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    },
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    },
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    },
    {
      img: 'assets/img/tu2.jpg',
      sub: '褚银良副市长督查环城南路东段快速化改褚银良副市长督查环城南路东段快速化改...',
      date: '2018-06-28',
      content: '1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、' +
      '建而不快”问题。城投公司总经理周宏伟陪同1月8日下午，褚银良副市长到环城南路东段快速化改造工程现场，督查中心城区建设用地“围而未建、建而不快”问题。城投公司总经理周宏伟陪同...'
    }
  ];

  constructor() {
  }

  ngOnInit() {
  }

}
